{"name":"clownfish","multimodal":false,"context":"The `clownfish` model recently made its debut in the LM Arena's Battle mode, alongside `cresylux`, `nettle`, and `octopus`.\n\nInitial reactions to `clownfish` were generally positive, with users describing it as \"good\" or \"seems good.\" There was some discussion and uncertainty regarding its anonymous identifier, with users initially noting it as \"R1\" but later questioning if it might be \"R2.\"\n\nSpeculation about its origin suggests `clownfish` is likely a Chinese model, with one user explicitly stating that all four new models are \"likely Chinese ones\" and \"maybe not from Google.\" There was also a speculative theory that it might involve a \"base model + reasoning model from deepseek.\"\n\nWhile some users were still inquiring about its quality, a specific rating from a \"discord clone\" community placed `clownfish` at **5/10**, ranking it similarly to `octopus` but significantly better than `nettle` (1/10)."}
{"name":"cresylux","multimodal":false,"context":"\n`cresylux` is one of the newly introduced models, also known by the alias **LongCat**. It's strongly associated with **Meituan**, a Chinese company that reportedly uses it internally. While one initial impression was \"meh,\" it's generally described as a **good non-reasoning model**. A significant point of discussion is its **very limited output**, which makes it difficult to test its coding capacity and has led to a reported \"output bug.\""}
{"name":"ernie-x1-turbo-32k-preview","multimodal":false,"context":"There's a bit of a mixed signal regarding `ernie-x1-turbo-32k-preview` on the LM Arena. One user announced it as a \"New model in Arena,\" but another quickly chimed in to say they didn't think it was new and had \"seen it before.\" Beyond this brief exchange about its novelty, there's no further discussion about its performance or capabilities in this snippet."}
{"name":"folsom-07152025-1","multimodal":false,"context":"The only buzz around `folsom-07152025-1` is its recent announcement by `martin_cz_` as a new model available in the LM Arena. There are no further details or user impressions mentioned in this chat log regarding its performance or characteristics."}
{"name":"kraken-07152025-1","multimodal":false,"context":"*none*"}
{"name":"kraken-07152025-2","multimodal":false,"context":"A new model, `kraken-07152025-2`, was announced for the LM Arena's Battle mode. However, this announcement was immediately met with skepticism and disbelief, with one user dismissing it as \"fake news\" and expressing confusion. There's no further discussion or details about the model's capabilities beyond its initial mention and subsequent questioning."}
{"name":"nettle","multimodal":false,"context":"\nNettle is one of the newly introduced anonymous models on the LM Arena leaderboard. Initial reactions suggest it performs **worse than R1** in general. Specifically, its **reasoning capabilities are rated very poorly, receiving a 1/10** in one assessment."}
{"name":"octopus","multimodal":false,"context":"There's quite a bit of buzz around **Octopus**, one of the new models recently introduced to the LM Arena leaderboard. Initial user ratings place it around 5/10, generally considering it worse than the current R1 model, despite being identified as a \"reasoning model.\"\n\nA significant point of discussion revolves around its identity. Users have reported that Octopus itself has claimed to be \"R1\" and even \"Claude\" (an Anthropic model), leading to observations about a recurring \"theme\" of models misidentifying themselves. This has fueled speculation about its true origin, with some users suggesting it, along with the other new models, is likely of Chinese origin."}
{"name":"step-1o-turbo-202506","multimodal":true,"context":"A new model, **\"step-1o-turbo-202506\"**, was briefly noted in the LM Arena leaderboard discussion. However, the provided chat log contains no further \"buzz\" or details regarding its features or performance, as the conversation quickly shifted to other topics."}
{"name":"stephen-v2","multimodal":false,"context":"There's a notable buzz surrounding the introduction of **`stephen-v2`** as a new model in LM Arena's Battle mode. Its arrival has coincided with a discussion about the platform potentially supporting video models, specifically image-to-video generation.\n\nUsers expressed surprise and excitement, with comments like \"What the hell ? Is now lmarena has video models...?\" and \"WHAT, where is that\". While one user clarified that the current setup might be a \"smart workaround\" for benchmarking, the general sentiment is one of curiosity and anticipation for the future of video model testing on LM Arena. There's a clear desire for full text-to-video benchmarking, with one user quickly realizing they can already submit their own prompts for testing."}
{"name":"stephen-vision-csfix","multimodal":true,"context":"*none*"}
{"name":"steve","multimodal":false,"context":"There's quite a buzz around **Steve**, an anonymous model recently appearing on the LM Arena leaderboard.\n\nThe primary speculation, and later a user-confirmed belief, is that **Steve is a new model from DeepSeek**. While some initially wondered if it was \"R2\" (another anticipated model) or even Grok 4, the consensus points to DeepSeek, possibly a \"low-end\" version or a \"distill of R1.\" One user even recalled previous \"Stephen\" models being from ByteDance, suggesting a playful naming convention by labs.\n\nRegarding its performance, the reception is mixed. Some users found it \"isn't so bad\" and noted it \"almost got all the answers right\" in certain scenarios. However, others were less impressed, stating it \"didn't pass this test\" and was \"way behind v3 and R1\" when tasked with complex tasks like creating a Discord clone. It's also noted that Steve \"thinks less time than R1 0528.\" One user described it as \"fuckin ass according to the tests yesterday,\" while another observed it might employ \"hybrid reasoning.\" Overall, it seems to be a new, intriguing contender, but its capabilities are still being thoroughly evaluated and debated among users."}
{"name":"X-preview","multimodal":false,"context":"The \"X-preview\" model is generating some buzz on the LM Arena. While it's currently in the battle section and not yet on the main leaderboard, users have noted a few interesting characteristics.\n\nInitially, there was some confusion, with a user mistakenly identifying it as **Grok 3.5**, which was quickly corrected. It has been observed to occasionally identify itself as an **OpenAI model**, with its responses strikingly resembling those of **GPT-4.1-mini**.\n\nHowever, X-preview is also associated with a specific type of error: when facing complex queries, it (along with some Qwen and Deepseek models) can trigger a battle-ending error, possibly due to max token limits or timeouts.\n\nThe most definitive information comes from the model itself, which, when prompted, identifies as **Baidu's Wenxin X1 (ERNIE X1)**. It states it was developed independently by Baidu using its PaddlePaddle deep learning framework, leveraging Baidu's AI expertise, and aims to provide a professional, secure, and contextually appropriate intelligent interaction experience in Chinese."}
