{"name":"clownfish","multimodal":false,"context":"\"Clownfish\" emerged as a new model in the LM Arena, quickly generating discussion among users.\n\nInitial reactions were largely positive, with users like `asura0_00` describing it as \"good\" and `i_am_dom` noting it was the first and only new model that \"caught [their] attention\" after multiple battles, suggesting it has \"potential to be good.\"\n\nThere was some speculation regarding its origin. While `interfir` broadly suggested the new models were \"likely Chinese ones,\" `asura0_00` specifically wondered if Clownfish might be \"not from Google\" and potentially a \"base model + reasoning model from DeepSeek.\"\n\nIn terms of performance, `davidszd` rated Clownfish at 5/10, indicating it was \"generally worse than R1\" and appeared to be a \"reasoning model.\" Despite this comparative rating, the qualitative feedback from users like `i_am_dom` highlighted its promising capabilities."}
{"name":"cresylux","multimodal":false,"context":"Cresylux is a new model that has recently appeared on the LM Arena leaderboard, also known by its codename \"LongCat.\" It's strongly associated with Meituan, a Chinese company that reportedly uses it internally, leading to the general consensus that it's likely a Chinese model.\n\nInitial impressions varied, with one user finding it \"meh,\" but it was later described as a \"good non reasoning model.\" A significant point of discussion is its limited output capacity, especially when testing its coding capabilities, which some users suspect might be due to a bug."}
{"name":"EB45-turbo","multimodal":false,"context":"*none*"}
{"name":"EB45-vision","multimodal":true,"context":"*none*"}
{"name":"folsom-07152025-1","multimodal":false,"context":"The only buzz around `folsom-07152025-1` is its recent announcement by `martin_cz_` as a new model available in the LM Arena. There are no further details or user impressions mentioned in this chat log regarding its performance or characteristics."}
{"name":"folsom-072125-1","multimodal":false,"context":"*none*"}
{"name":"folsom-072125-2","multimodal":false,"context":"*none*"}
{"name":"kraken-072125-1","multimodal":false,"context":"The buzz around **kraken-072125-1** is decidedly negative. One user, aplex_gg, explicitly stated that the model \"sucks.\" This stands in contrast to the more positive or curious discussions surrounding other models like Zenith, 2.5Pro, and Summit within the LM Arena context."}
{"name":"kraken-072125-2","multimodal":false,"context":"*none*"}
{"name":"nettle","multimodal":false,"context":"**Nettle: A New Contender, But Not a Champion**\n\n\"Nettle\" is one of several new models recently introduced to the Arena, alongside \"clownfish,\" \"cresylux,\" and \"octopus.\" While new, the initial reception for Nettle has been largely negative.\n\nUsers quickly assessed its performance, with one particularly harsh rating of **1/10**, noting it's \"generally worse than R1\" and specifically struggles as a \"reasoning model.\" Another user, i_am_dom, echoed this sentiment, stating that while it's \"something new,\" it's definitely \"isn't groundbreaking.\" There's also speculation that, like the other new models, \"nettle\" is likely of Chinese origin."}
{"name":"nightride-on","multimodal":true,"context":"There's a notable buzz around **Nightride-on** in the LM Arena. It's widely believed to be a **new Google model**, with users reporting the appearance of both **nightride-on** and **nightride-on-v2** versions.\n\nEarly impressions are positive, with one user describing **nightride-on** as \"omg it's strong for my task based on knowledge.\"\n\nThe most significant aspect of the buzz, however, is the apparent secrecy surrounding it. A user explicitly requested the deletion of mentions, stating that its presence is \"not public info,\" despite it reportedly being seen on X (Twitter). This suggests it's an unannounced or sensitive model currently being tested."}
{"name":"nightride-on-v2","multimodal":true,"context":"There's a buzz around **nightride-on-v2**, a newly added model to the LM Arena leaderboard. It's generating excitement, with users noting its fresh appearance alongside other new models like \"nightride-on\" and recent Chinese models.\n\nOne user speculates that **nightride-on-v2** could potentially be \"2.5 flash with deep think enabled,\" hinting at a possible connection to a new Google model. Its presence is clearly new, as one user expressed surprise, stating they hadn't seen it before."}
{"name":"octopus","multimodal":false,"context":"The \"octopus\" model is a newly introduced, anonymous model on the LM Arena leaderboard that has generated quite a bit of buzz. Initial impressions are mixed to negative, with one user rating its reasoning capabilities at 5/10, generally worse than the established R1 model.\n\nA notable characteristic of Octopus is its tendency to misidentify itself, claiming to be both R1 and Claude at different times. More strikingly, users report that it \"dropped way too many F-bombs,\" leading to speculation that it might be a \"grok childish finetune\" due to its \"detached\" and profanity-laden responses. The identity of the company behind Octopus remains unknown, prompting questions from the community. Its underwhelming performance has also led to financial losses for those who bet on it being a top-tier model."}
{"name":"step-1o-turbo-202506","multimodal":true,"context":"A new model, **\"step-1o-turbo-202506,\"** has been announced on the LM Arena leaderboard.\n\nBeyond its initial mention, there's no further discussion or \"buzz\" about this specific model in the provided conversation snippet. The conversation immediately shifts to user experiences with Gemini."}
{"name":"stephen-v2","multimodal":false,"context":"*none*"}
{"name":"stephen-vision-csfix","multimodal":true,"context":"*none*"}
{"name":"steve","multimodal":false,"context":"The anonymous model \"Steve\" on the LM Arena leaderboard has been a hot topic, sparking much debate and curiosity among users.\n\nInitially, there was significant speculation regarding Steve's true identity. Theories ranged from it being a new model from **DeepSeek** (with some wondering if it was the anticipated R2, or perhaps a distill of R1), to a model developed by **ByteDance**, given previous \"Stephen\" models from that lab.\n\nHowever, the mystery was largely resolved when a user reported that \"Steve\" consistently self-identifies as **\"Amazon Titan,\"** strongly indicating its origin from Amazon Web Services.\n\nPerformance reviews for Steve have been quite mixed. Some users found it to be underwhelming, describing it as \"not very good,\" \"very dumb,\" or even \"fuckin ass\" based on their tests, noting it lagged behind models like v3 and R1 on certain tasks (e.g., creating a Discord clone). Conversely, others offered more positive assessments, stating it \"almost got all the answers right\" and \"isn't so bad.\" It was also observed to think faster than R1 and exhibit \"hybrid reasoning.\" The unusual choice of \"Steve\" as a model name also generated some amusement and confusion among the community."}
{"name":"summit","multimodal":true,"context":"The anonymous model \"Summit\" on LM Arena is generating considerable excitement among users, who describe it as \"insane\" and \"really good,\" often \"destroying the opponent\" in battles.\n\nThere's strong speculation that Summit, along with Zenith and Lobster, are different versions of OpenAI's upcoming GPT-5, with some users suggesting Summit might be a \"GPT-5 mini\" or a variant sharing the same underlying architecture as Zenith.\n\nIn terms of performance, user benchmarks frequently place Summit very highly, sometimes second only to Lobster, and occasionally outperforming Zenith in specific tasks like mathematics. It's widely regarded as having surpassed previous top contenders like the Gemini models. While generally powerful, some users noted specific instances where it struggled with complex reasoning problems or exhibited peculiar behaviors, such as adding detailed caveats to answers (e.g., for the Monty Hall problem) or starting responses with a unique phrase like \"Love this space.\" It's also suggested that its full potential might be masked in certain environments like the webdev arena due to system prompts."}
{"name":"X-preview","multimodal":false,"context":"*none*"}
{"name":"zenith","multimodal":true,"context":"There's a significant buzz surrounding **Zenith** on the LM Arena leaderboard, with many users speculating it could be **GPT-5** or a variant of it, given its name and perceived capabilities. It's often discussed alongside \"Summit\" and \"Lobster,\" with the general consensus being that these three models share a similar underlying architecture, possibly representing different versions of OpenAI's next-generation model.\n\nUsers are reporting mixed but largely positive experiences:\n\n*   **Strengths:** Zenith is lauded for its \"insane\" performance, with some calling it \"AGI\" and \"amazing.\" It's particularly highlighted for its **SVG generation** (considered \"one of the best if not nr1\"), strong **coding abilities**, and remarkable **context understanding**. It has even introduced \"new perspectives\" on complex physics questions, a departure from the typical responses of other models. Its code generation is described as \"awesome,\" and its story-writing style is noted as \"vastly different\" from previous models.\n*   **Comparisons:** While some benchmarks place it behind Lobster and Summit in overall performance (e.g., one user's benchmark had Lobster at 81%, Summit 74%, Zenith 65%), it's often considered the best for coding. Many users feel it \"blows 4o out of the water\" for general text and has \"proved wrong\" those confident that Gemini models couldn't be topped. It's also explicitly stated to be \"better than kingfall.\"\n*   **Weaknesses/Concerns:** Despite its strengths, Zenith isn't without its criticisms. Some users report it can \"hallucinate\" within answers, exhibit \"weird logic,\" or be \"over rhetoric,\" using \"fancy words\" that sometimes lead to \"overdoing it.\" There are also observations of it using \"special characters instead of '-' symbols\" which can break interpreters. One user even initially found it \"not impressive\" and selected \"both are bad\" in a comparison.\n*   **Availability:** Accessing Zenith on LM Arena is described as challenging due to low probability, with users reporting getting it only \"once every 5 attempts\" or \"twice\" in many tries. It appears to be available on LM Arena but not consistently on \"webdev arena,\" leading to frustration among those trying to test it.\n\nOverall, Zenith is generating considerable excitement as a potentially groundbreaking model, pushing the boundaries of what users expect from AI, despite some noted quirks and inconsistencies."}
